app/Controllers/BaseController.php

SELECT COUNT(*) AS `numrows`
FROM `carts`
WHERE `user_id` = '2'
---
    protected function getCartCount()
    {
        $user_id = $this->session->get('user_id') ?? 0;

        if ($user_id == 0) {
            return 0;
        }

        $cartModel = new \App\Models\CartModel();
        return $cartModel->where('user_id', $user_id)->countAllResults();