app/Controllers/Home.php

    public function index()
    {
                if ($response = $this->checkLogin()) return $response;

        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `products`