app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'password123'
 LIMIT 1
---
    public function auth()
    {
        $username    = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first(); // ✅ Query builder (safe)